app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_number", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["course_number", "4990"], ["created_at", "2014-06-25 16:10:41.812971"], ["title", "Web Frameworks"], ["updated_at", "2014-06-25 16:10:41.812971"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save