app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.courses << Course.find(params[:course_id])
---
INSERT INTO "students" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-26 15:35:18.398561"], ["name", "Bob"], ["updated_at", "2014-06-26 15:35:18.398561"]]
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 3]]